# На вход программе подается последовательность чисел. Каждое число
# на отдельной строке. Ввод чисел продолжается до тех пор, пока пользователь
# не введет число, принадлежащее отрезку [-2; 5]. После этого программа должна вывести
# минимальное из введенных чисел и количество введенных чисел.
#  img/1.4.1.png

array = []
while True: 
    x = int(input("Введите число: "))
    array.append(x)
    if x > -2 and x < 5:
        break

minimum = min(array)
count = len(array)

print("Минимальное значение - " + str(minimum))
print("Количество чисел - " + str(count))
