# На вход программе подаются два целых числа – границы диапазона. Необходимо перебрать все целые числа в данном диапазоне (включая границы) и для всех чисел, удовлетворяющих условию отбора, посчитать величину, указанную в варианте. 
# Например,
# условие отбора: x чётно,
# искомая величина: сумма.
# В таком случае необходимо найти сумму чётных чисел из заданного пользователем диапазона. Диапазон необходимо ввести с клавиатуры.
# Диапазон abs(cos(X))<0.5. Вывести количество и сумму.

import math

a = int(input("Введите первое число "))
b = int(input("Введите второе число "))

count = 0
amount = 0

for i in range(a, b+1):
    if abs(math.cos(i)) < 0.5:
        count+= 1
        amount+= i

print(count)
print(amount)
