# Напишите программу, которая вычисляет доход по вкладу.
# Процентная ставка (в процентах годовых) и время хранения (в днях)
# задаются во время работы программы.


print("Введите исходные данные:")
value = int(input("Величина вклада (руб.) -> "))
period = int(input("Срок вклада (дней) -> "))
percent = int(input("Процентная ставка (годовых) -> "))
profit = round(((percent/365)*period/100)*value, 2)
total = profit+value
print("Доход: " + str(profit) + "руб.")
print("Сумма по окончании срока вклада:" + str(total) + "руб.")